Case5_Soft_Spring/system/fvOptions
/*----------------*- C++ -*--------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  www.openfoam.com
    \\  /    A nd           | Version:  v2412
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

oscillatingSource
{
    type            tabulatedAccelerationSource;
    selectionMode   all;

    timeDataFileName "$FOAM_CASE/constant/acceleration.dat";
}

// ************************************************************************* //